app/controllers/users/registrations_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "confirmation_token", "confirmation_sent_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = @current_week.users.new(sign_up_params)
    if @user.save